       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ***************************************************************
      ** AREA DE COMENTARIO - REMARKS
      ** AUTHOR = LEO(ESTUDANTE) LEOO
      ** OBJETIVO: MOSTRAR A STRING HELLO ALURA
      ** DATA = XX/XX/XXX
      ***************************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
